Revit 2027 API
MultiReferenceAnnotation.AreElementsValidForMultiReferenceAnnotation Method
 The method validates if the input elements match the element category id for the MultiReferenceAnnotationType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreElementsValidForMultiReferenceAnnotation(
	Document document,
	MultiReferenceAnnotationOptions options
)
Public Shared Function AreElementsValidForMultiReferenceAnnotation (
	document As Document,
	options As MultiReferenceAnnotationOptions
) As Boolean
public:
static bool AreElementsValidForMultiReferenceAnnotation(
	Document^ document,
	MultiReferenceAnnotationOptions^ options
)
static member AreElementsValidForMultiReferenceAnnotation :
        document : Document *
        options : MultiReferenceAnnotationOptions -> bool
Parameters
document Document
 The document for the multi-reference annotation.
options MultiReferenceAnnotationOptions
 The creation options for the new MultiReferenceAnnotation.
Return Value
Boolean
 Returns true if the input elements match the element category id for the MultiReferenceAnnotationType, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace